[
    {"id":1, "c":1, "q":"Elasticity is one of the AWS Cloud architecture principles. Which of the following is an example of Elasticity?", "a":"Scale compute resources in and out while only paying for the resources used", "d": ["Scaling on-premises resources", "Scaling AWS resources using Elastic Load Balancer (ELB)", "Connecting on-premise Data centers with AWS VPC using Direct Connect"], "e":"Elasticity is the ability to automatically acquire resources as you need them and release them when you don't, matching supply with demand."},
    {"id":2, "c":2, "q":"You suspect that your AWS account is compromised. Who should you report this to?", "a":"AWS Support", "d": ["AWS Abuse Team", "AWS Operations Team", "AWS Trusted Advisor", "AWS Inspector"], "e":"If you suspect YOUR account is compromised (e.g., unauthorized root login), contact AWS Support (Trust & Safety) immediately. Note: The Abuse Team is for reporting attacks COMING from AWS resources."},
    {"id":3, "c":4, "q":"Which feature allows you to categorize and track your AWS costs by project or department in your billing reports?", "a":"Cost Allocation Tags", "d": ["AWS Budgets", "AWS Trusted Advisor", "Consolidated Billing", "AWS CloudTrail"], "e":"Cost Allocation Tags are metadata (key-value pairs) you attach to resources. You can activate them in the billing console to track costs by those tags."},
    {"id":4, "c":2, "q":"Which credential is required to establish a secure SSH connection to a Linux-based EC2 instance?", "a":"Key Pair", "d": ["Access Keys", "MFA Token", "IAM Password", "Security Group"], "e":"A Key Pair (public/private key) is required to authenticate via SSH to an EC2 instance. Passwords are disabled by default."},
    {"id":5, "c":1, "q":"What are the three main models for cloud computing? (Select THREE)", "a":"Infrastructure as a Service (IaaS), Platform as a Service (PaaS), Software as a Service (SaaS)", "d": ["On-premises", "Cloud", "Hybrid", "Serverless as a Service"], "e":"The three standard cloud service models are IaaS (Infrastructure), PaaS (Platform), and SaaS (Software)."},
    {"id":6, "c":2, "q":"Which of the below options are you responsible for when running an RDS database on AWS?", "a":"Controlling access to the database", "d": ["Controlling access to the host machine", "Patching database software", "Controlling access to the hardware", "Managing the underlying OS"], "e":"RDS is a managed service. AWS handles the OS, patching, and hardware. You are responsible for the data and managing database access."},
    {"id":7, "c":1, "q":"What are design principles for performance efficiency in the cloud? (Select TWO)", "a":"Experiment more often, Use serverless architectures", "d": ["Anticipate failure", "Automatically recover from failure", "Test recovery procedures", "Scale vertically"], "e":"Performance Efficiency principles include democratizing advanced technologies, going global, using serverless architectures, and experimenting more often."},
    {"id":8, "c":2, "q":"Which of the following is the document used to grant permissions to users, groups, and roles?", "a":"Policy", "d": ["Protocols", "Passport", "AWS Document Service", "Token"], "e":"Permissions in IAM are defined in JSON documents called Policies."},
    {"id":9, "c":1, "q":"Which of the following scenarios are examples of scaling an IT architecture vertically? (Select TWO)", "a":"Resizing an EC2 instance type from T2.micro to T2.large, Change the RDS instance type to one with more CPU/RAM", "d": ["Adding more RDS instances", "Adding more EC2 instances", "Distributing traffic across zones", "Using Auto Scaling Groups"], "e":"Vertical scaling (Scaling Up) means increasing the specifications (CPU/RAM) of a single resource. Horizontal scaling (Scaling Out) means adding more resources."},
    {"id":10, "c":3, "q":"A company wants to decouple their monolithic application. Which AWS service can help them to achieve this?", "a":"Amazon SQS", "d": ["Amazon Kinesis", "Amazon DynamoDB", "Amazon SES", "AWS Lambda"], "e":"SQS (Simple Queue Service) acts as a buffer between components, allowing them to operate independently (decoupled)."},
    {"id":11, "c":4, "q":"If you want access to all AWS Trusted Advisor checks, which of these support plans will provide that? (Select TWO)", "a":"Enterprise, Business", "d": ["Basic", "Standard", "Developer"], "e":"The full set of Trusted Advisor checks is only available to the Business and Enterprise support plans."},
    {"id":12, "c":2, "q":"Which service can be used to create and provide trusted users with temporary security credentials?", "a":"AWS Security Token Service (STS)", "d": ["AWS IAM Identity Center", "AWS Organizations", "Amazon GuardDuty", "AWS IAM"], "e":"AWS STS enables you to request temporary, limited-privilege credentials for users."},
    {"id":13, "c":4, "q":"A company needs to view their AWS expenses and service usage over time in graphical form. Which AWS service will provide this information?", "a":"AWS Cost Explorer", "d": ["AWS Cost Categories", "AWS CloudTrail", "AWS CloudWatch", "AWS Budgets"], "e":"Cost Explorer is the tool for visualizing and analyzing your costs and usage history."},
    {"id":14, "c":3, "q":"Which of the following is a hybrid cloud storage with local caching service that allows on-premises applications to access data on AWS Cloud?", "a":"AWS Storage Gateway", "d": ["AWS Direct Connect", "Amazon EBS", "AWS Snowball", "Amazon S3"], "e":"AWS Storage Gateway connects on-premises appliances with cloud-based storage, often using local caching for speed."},
    {"id":15, "c":3, "q":"A user has to migrate petabytes of data to AWS. Which service is MORE cost-effective and FASTER than transferring data over 100 Mbps internet connection?", "a":"AWS Snowball", "d": ["AWS Snowmobile", "Amazon S3 Transfer Acceleration", "AWS Direct Connect", "AWS VPN"], "e":"For petabyte-scale transfers with limited bandwidth, Snowball (physical transport) is significantly faster and cheaper than the internet."},
    {"id":16, "c":1, "q":"How would you describe the value proposition of AWS Cloud? (Select TWO)", "a":"Stop guessing about Capacity, Trade capital expense for variable expense", "d": ["Managing lift and shift of your data center to AWS", "Requiring long term commitment", "Fixed monthly expense", "Physical access to servers"], "e":"Key benefits: Trade CapEx for OpEx (Variable expense) and Stop guessing capacity (Elasticity)."},
    {"id":17, "c":2, "q":"What tasks can only be done using root user credentials? (Select TWO)", "a":"Close the AWS account, Change the AWS Support plan", "d": ["Create IAM users", "Provisions new resources", "Delete S3 buckets", "Stop EC2 instances"], "e":"Only the root user can close the account and change the support plan (and a few other account-level tasks)."},
    {"id":18, "c":4, "q":"A company has developed a media transcoding application designed to recover gracefully from failures. Which instance type is most cost-effective?", "a":"Spot instances", "d": ["Reserved instances", "On-Demand instances", "Dedicated instances", "Dedicated Hosts"], "e":"Since the application handles failure gracefully, Spot Instances (up to 90% discount) are the best choice."},
    {"id":19, "c":2, "q":"You are using your corporate directory to grant your users access to AWS services. What is this called?", "a":"Federated Access", "d": ["User Group Access", "Temporary Access", "Token Access", "IAM Access"], "e":"Federation involves using an external identity provider (IdP) to manage users and granting them access to AWS resources."},
    {"id":20, "c":2, "q":"You see resources in your AWS account that you don't remember creating. What are the most immediate actions you should take? (Select TWO)", "a":"Change your AWS account root user password, Delete any unrecognized or unauthorized resources", "d": ["Report to Trusted Advisor", "Ask for help on AWS forums", "Wait 24 hours", "Create a new account"], "e":"If compromised: Secure the account (change credentials) and remove the threat (delete resources) immediately."},
    {"id":21, "c":4, "q":"A company is launching a new web application attracting high traffic. As part of Enterprise support, what provides architectural/scaling guidance?", "a":"Infrastructure Event Management", "d": ["Support Concierge", "AWS Trusted Advisor", "Account Onboarding", "Technical Account Manager"], "e":"Infrastructure Event Management (IEM) is available to Enterprise customers to help plan for large-scale launches."},
    {"id":22, "c":4, "q":"Which of the following Amazon EC2 pricing models automatically applies to usage across different instance families and regions?", "a":"Compute Savings Plans", "d": ["Spot Instances", "Dedicated Hosts", "Reserved Instances"], "e":"Compute Savings Plans offer the most flexibility, applying to usage across any instance family and region."},
    {"id":23, "c":4, "q":"A company has launched an image-sharing app and expects spiky and unpredictable traffic. Which is the MOST cost-effective instance pricing model?", "a":"On-demand", "d": ["Dedicated", "Spot block", "Reserved"], "e":"For unpredictable/spiky traffic where you cannot commit to a term, On-Demand is the standard choice. (Spot is risky if interruptions cannot be handled)."},
    {"id":24, "c":1, "q":"AWS recommends decoupling applications. What is the advantage of this approach?", "a":"Reduce inter-dependencies so failures do not impact other components", "d": ["Ability to deploy the application through a single deployment", "Ability to execute automated bootstrapping", "Enable data synchronization"], "e":"Decoupling prevents cascading failures. If one component fails, the others can continue to work."},
    {"id":25, "c":2, "q":"Under the Shared Responsibility Model, which of the below are you responsible for when storing data in S3? (Select TWO)", "a":"Client-side encryption, Bucket configuration (Public/Private)", "d": ["Who has access to the network hardware", "Who has access to S3 hardware", "Who has access to the S3 Infrastructure", "Patching the S3 operating system"], "e":"You control the data (encryption) and the configuration (policies/ACLs). AWS manages the physical infrastructure."},
    {"id":26, "c":3, "q":"A company has developed an application and want to cache its data closer to users? Which of the following AWS services can they use?", "a":"Amazon CloudFront", "d": ["Amazon Artifact", "Amazon Route 53", "AWS Global Accelerator"], "e":"CloudFront is a Global Content Delivery Network (CDN) that caches content at Edge Locations."},
    {"id":27, "c":3, "q":"What feature of the AWS Virtual Private Cloud (VPC) can you use to capture IP traffic going to and from network interfaces in your VPC?", "a":"VPC Flow Logs", "d": ["AWS CloudWatch Logs", "AWS CloudTrail", "NAT Gateway"], "e":"VPC Flow Logs capture information about IP traffic going to and from network interfaces."},
    {"id":28, "c":3, "q":"Which of the following are examples of AWS-Managed Services? (Select THREE)", "a":"Amazon DynamoDB, Amazon Redshift, AWS Lambda", "d": ["Amazon EC2", "AWS IAM", "Amazon VPC", "Amazon EBS"], "e":"Managed services abstract the OS and server management. EC2 is unmanaged (you manage the OS)."},
    {"id":29, "c":2, "q":"Which service is the most cost-effective for protection against network and transport layer DDoS attacks?", "a":"AWS Shield Standard", "d": ["AWS WAF", "AWS Shield Advanced", "AWS Trusted Advisor"], "e":"AWS Shield Standard is free and provides automatic protection against common Layer 3/4 attacks."},
    {"id":30, "c":4, "q":"Your manager asks you to estimate monthly cost of AWS services the new application based on expected usage. What tool can you use to calculate?", "a":"AWS Pricing Calculator", "d": ["AWS Simple Monthly Calculator", "AWS Total Cost of Ownership (TCO) calculator", "AWS SAP Calculator"], "e":"The AWS Pricing Calculator is the modern web-based planning tool for estimating costs. (Simple Monthly Calculator is deprecated)."},
    {"id":31, "c":2, "q":"What is the AWS automated security assessment service that helps improve the security and compliance of applications deployed on AWS?", "a":"Amazon Inspector", "d": ["Amazon Trusted Advisor", "AWS Config", "AWS X-Ray"], "e":"Inspector automatically assesses applications for exposure, vulnerabilities, and deviations from best practices."},
    {"id":32, "c":3, "q":"It is crucial to store database backup on a medium which is secure and makes database readily available. What is the most cost-effective storage option?", "a":"Amazon S3", "d": ["Amazon EFS", "Amazon S3 Glacier", "Amazon EBS"], "e":"S3 Standard or S3 Standard-IA are 'readily available' and cheaper than EBS/EFS. Glacier is cheaper but not 'readily available'."},
    {"id":33, "c":3, "q":"A company is migrating their applications/databases to AWS to reduce cost. Which factor is main for choosing instance type of RDS/Redshift?", "a":"CPU and RAM utilization", "d": ["Type of your current database", "Location of users", "Your team experience with AWS"], "e":"Instance types are primarily defined by their CPU and Memory (RAM) capacity."},
    {"id":34, "c":2, "q":"What is the recommended way to give your applications running in EC2 permission to make API requests to other AWS resources?", "a":"Create an IAM Role and assign it to the instance", "d": ["Create an IAM User and embed keys", "Save Access Key ID in config file", "Use Root credentials"], "e":"Always use IAM Roles for compute services to avoid managing long-term credentials."},
    {"id":35, "c":3, "q":"In AWS' Global Infrastructure, what are Edge Locations responsible for?", "a":"Hosting CloudFront to deliver content", "d": ["Providing redundant backup", "Connecting Availability Zones", "Providing disaster recovery"], "e":"Edge Locations are used by CloudFront to cache content closer to end-users."},
    {"id":36, "c":4, "q":"What is the minimum level of AWS support that provides 24x7 access to Cloud support engineers via phone, email and chat?", "a":"Business Support", "d": ["Developer Support", "Basic Support", "Enterprise Support"], "e":"Developer has business hours access. Business Support is the first tier with 24/7 phone/chat/email."},
    {"id":37, "c":3, "q":"Which of the following are true about Amazon Route 53? (Select TWO)", "a":"It allows you to check the health of your resources, It provides a highly available and scalable DNS web service", "d": ["It is a regional service", "It is named after Route 53 in the USA", "It provides load balancing only"], "e":"Route 53 is a global DNS service that also performs health checks on resources."},
    {"id":38, "c":2, "q":"Which of the following AWS services control Authentication and Authorization within an AWS account?", "a":"AWS IAM", "d": ["Amazon Inspector", "AWS Trusted Advisor", "Access Control Lists"], "e":"IAM (Identity and Access Management) handles AuthN (who you are) and AuthZ (what you can do)."},
    {"id":39, "c":3, "q":"Which of the following is an AWS database service that provides virtually unlimited throughput and storage?", "a":"Amazon DynamoDB", "d": ["Amazon Neptune", "Amazon Elasticsearch", "Amazon Redshift"], "e":"DynamoDB is a serverless key-value DB that scales horizontally to support virtually any throughput."},
    {"id":40, "c":3, "q":"Which of the following are AWS Infrastructure automation tools? (Select TWO)", "a":"AWS OpsWorks, AWS CloudFormation", "d": ["AWS Macie", "AWS Config", "AWS Trusted Advisor", "AWS Inspector"], "e":"CloudFormation (IaC) and OpsWorks (Configuration Management) are used to automate infrastructure provisioning."},
    {"id":41, "c":3, "q":"Which of the following enables you to set up a logically isolated section of your cloud?", "a":"Amazon VPC", "d": ["AWS IAM", "AWS Subnet", "AWS Edge Location", "AWS SNS"], "e":"A Virtual Private Cloud (VPC) is your isolated network environment in the cloud."},
    {"id":42, "c":2, "q":"What are the change management tools that help AWS customers audit and monitor all resource changes in their AWS environment? (Select TWO)", "a":"AWS CloudTrail, AWS Config", "d": ["AWS Inspector", "AWS Shield", "AWS Artifact", "AWS Trusted Advisor"], "e":"CloudTrail records the API calls (Who/When), and AWS Config records the state changes (What changed)."},
    {"id":43, "c":2, "q":"What are access types for IAM user? (Select TWO)", "a":"Programmatic access, AWS Management Console access", "d": ["Biometric Access", "AWS Root Access", "Physical Key Access", "Database Access"], "e":"IAM Users can be given Console access (password) and/or Programmatic access (Access Keys)."},
    {"id":44, "c":2, "q":"What are the default security credentials that are required to access the AWS management console for an IAM user account?", "a":"Username and Password", "d": ["MFA Token", "Access Key ID", "Secret Access Key", "Key Pair"], "e":"Console access requires a username and password. Access Keys are for CLI/SDK."},
    {"id":45, "c":1, "q":"A company is looking for help in designing a new cloud application that adheres to AWS's best practices. Which of the following can provide guidance?", "a":"AWS Well-Architected Tool", "d": ["AWS Cost Explorer", "AWS Trusted Advisor", "AWS Inspector", "AWS Shield"], "e":"The Well-Architected Tool compares your workload against the 6 pillars of the Well-Architected Framework."},
    {"id":46, "c":2, "q":"In AWS Well-Architected Framework, which of the following are components of the Security Pillar? (Select THREE)", "a":"IAM, Infrastructure Protection, Detective Controls", "d": ["Cost Optimization", "Performance Efficiency", "Sustainability", "Reliability"], "e":"Security pillar focuses on protecting information. Key topics: IAM, Detective Controls, Infra Protection, Data Protection, Incident Response."},
    {"id":47, "c":1, "q":"Which of the following is a practice to minimize dependencies between components and to avoid one point of failure?", "a":"Loose coupling", "d": ["Tight coupling", "Monolithic architecture", "Hard coding", "Server-side rendering"], "e":"Loose coupling (using queues, etc.) ensures components are not strictly dependent on one another's availability."},
    {"id":48, "c":3, "q":"You are developing a distributed application which requires task coordination across all components. Which of the following AWS services will help with that?", "a":"AWS Step Functions", "d": ["Amazon SNS", "Amazon EFS", "Amazon RDS", "AWS Lambda"], "e":"AWS Step Functions is the modern serverless orchestration service for coordinating distributed applications."},
    {"id":49, "c":4, "q":"Which of the following activities may help reduce your AWS monthly costs?", "a":"Enabling Amazon EC2 Auto Scaling for all of your workloads", "d": ["Using On-Demand Instances for all workloads", "Provisioning servers for peak capacity", "Disabling CloudWatch", "Using Dedicated Hosts"], "e":"Auto Scaling allows you to turn off resources when they aren't needed, preventing you from paying for idle capacity."},
    {"id":50, "c":1, "q":"Which feature of the cloud eliminates the need to estimate future application usage?", "a":"Elasticity", "d": ["Monitoring", "Provisioning", "Deploying", "Auditing"], "e":"Elasticity (scaling) removes the need to guess capacity; you scale as demand dictates."},
    {"id":51, "c":3, "q":"What is the easiest way to launch and manage a virtual private server in AWS?", "a":"Amazon Lightsail", "d": ["Amazon EC2", "Amazon ECS", "AWS Lambda", "AWS Fargate"], "e":"Lightsail provides a simplified, pre-configured VPS experience for simple workloads."},
    {"id":52, "c":2, "q":"Which of the following is AWS' managed DDoS protection service? (Select TWO)", "a":"AWS Shield Advanced, AWS Shield Standard", "d": ["AWS WAF", "AWS Inspector", "AWS Macie", "AWS GuardDuty"], "e":"AWS Shield is the dedicated DDoS protection service."},
    {"id":53, "c":1, "q":"Deploying your EC2 instances across multiple AZs will help address which Cloud Concept?", "a":"High Availability", "d": ["Fault Tolerance", "Scalability", "Elasticity", "Agility"], "e":"Using multiple Availability Zones ensures your application stays available even if one data center fails."},
    {"id":54, "c":3, "q":"Which AWS service is a fully managed Pub/Sub messaging service used for fan-out messaging?", "a":"Amazon SNS", "d": ["Amazon SQS", "Amazon SES", "Amazon Connect", "AWS Step Functions"], "e":"Amazon SNS (Simple Notification Service) enables Pub/Sub messaging for fan-out architectures (one message to multiple subscribers)."},
    {"id":55, "c":2, "q":"At which two levels can you configure access control for S3? (Select TWO)", "a":"Bucket Policies, Access Control Lists (ACLs)", "d": ["Region", "Availability Zone", "Global", "Account"], "e":"S3 access is controlled via Bucket Policies (Resource-based) and ACLs (Legacy Object-based)."},
    {"id":56, "c":1, "q":"Which of the following factors should be considered when determining the region in which AWS Resources will be provisioned? (Select TWO)", "a":"Data sovereignty, Latency", "d": ["Weather conditions", "Local currency", "Language spoken", "Time zone"], "e":"Choose regions based on where your data legally must reside (Sovereignty) and proximity to users (Latency)."},
    {"id":57, "c":4, "q":"For AWS Enterprise support users, how does AWS help with infrastructure event management?", "a":"AWS helps users plan for large-scale events such as product launches and marketing events", "d": ["AWS manages the event for you", "AWS provides free hardware", "AWS offers discounts", "AWS writes the application code"], "e":"IEM is a structured program to help plan and execute major events to ensure stability."},
    {"id":58, "c":2, "q":"Which of the following AWS Identity and Access Management best practices adds an extra layer of protection in addition to the default authentication mechanism of usernames and passwords?", "a":"Multi-Factor Authentication (MFA)", "d": ["Strong Password Policy", "Access Keys", "IAM Roles", "Security Groups"], "e":"MFA requires a second factor (token/device) to login, significantly increasing security."},
    {"id":59, "c":3, "q":"A company is managing a message-broker themselves and want to move it to fully managed cloud service without rewriting the messaging code in their applications. Which AWS service can they use?", "a":"Amazon MQ", "d": ["Amazon SNS", "Amazon SQS", "AWS Lambda", "Amazon Kinesis"], "e":"Amazon MQ supports standard protocols (MQTT, AMQP) for ActiveMQ/RabbitMQ, allowing migration without rewriting code."},
    {"id":60, "c":3, "q":"Your company has been experiencing issues with their MySQL database. They have decided to migrate their database to AWS so they do not have to spend time on managing backups, patching, disaster recovery and performance. Which of the following AWS service will help them implement this?", "a":"Amazon RDS", "d": ["Amazon EC2 with MySQL", "Amazon DynamoDB", "Amazon Redshift", "Amazon S3"], "e":"RDS automates backups, patching, and high availability for relational databases like MySQL."},
    {"id":61, "c":2, "q":"What are AWS' recommendations regarding root access keys?", "a":"Delete them (if they exist) and do not create new ones", "d": ["Rotate them every 30 days", "Share them with admins", "Use them for daily tasks", "Store them in S3"], "e":"The root account should NOT have access keys. If it does, delete them. Use IAM users for programmatic access."},
    {"id":62, "c":1, "q":"One of the design principles in the Reliability pillar of AWS Well-Architected Framework is 'Scale horizontally to increase aggregate system availability'. How can we achieve this? (Select TWO)", "a":"Distribute requests across multiple smaller resources, Replace one large resource with multiple small resources", "d": ["Increase the size of the instance", "Use a single large instance", "Upgrade the CPU", "Add more RAM"], "e":"Horizontal scaling = adding more instances. Vertical scaling = increasing instance size."},
    {"id":63, "c":3, "q":"What service does AWS offer to simplify the connection management among hundreds of VPCs in multiple AWS regions?", "a":"AWS Transit Gateway", "d": ["VPC Peering", "AWS Direct Connect", "VPN Gateway", "NAT Gateway"], "e":"Transit Gateway acts as a cloud router to connect VPCs and on-prem networks centrally."},
    {"id":64, "c":3, "q":"Which of the following cache engines are supported by Amazon ElastiCache? (Select TWO)", "a":"Memcached, Redis", "d": ["MySQL", "PostgreSQL", "MariaDB", "Oracle"], "e":"ElastiCache is for in-memory stores: Redis and Memcached."},
    {"id":65, "c":1, "q":"You have launched your application to international users, but international users are complaining of high latency. What is the AWS characteristic that can help improve your international users experience?", "a":"Global reach", "d": ["High Availability", "Scalability", "Elasticity", "Security"], "e":"AWS Global Reach (Global Infrastructure) lets you deploy in regions closer to your users."},
    {"id":66, "c":1, "q":"Which of the following are principles of sound cloud design? (Select TWO)", "a":"Scalability, Disposable resources", "d": ["Manual deployments", "Tight coupling", "Single point of failure", "Fixed capacity"], "e":"Design for failure (disposable resources) and loose coupling/scalability are key cloud principles."},
    {"id":67, "c":3, "q":"What is the AWS service that enables AWS architects to manage infrastructure as code?", "a":"AWS CloudFormation", "d": ["AWS Config", "AWS OpsWorks", "AWS Systems Manager", "AWS Trusted Advisor"], "e":"CloudFormation provisions resources based on JSON/YAML templates (Infrastructure as Code)."},
    {"id":68, "c":4, "q":"A company wants to consolidate billing from all of their AWS accounts to benefit from single payment method for all of their AWS accounts. Which service will you recommend them to use?", "a":"AWS Organizations", "d": ["AWS Cost Explorer", "AWS Budgets", "AWS Billing Dashboard", "AWS Trusted Advisor"], "e":"AWS Organizations enables Consolidated Billing for multiple accounts."},
    {"id":69, "c":2, "q":"You and your team are responsible for analysing logs to detect any malicious activity or threat. Your manager is concerned that it is time-consuming and unreliable to analyses logs manually so wants to use AWS managed service for this. Which service will you recommend for this purpose?", "a":"Amazon GuardDuty", "d": ["AWS Inspector", "AWS Shield", "AWS WAF", "Amazon Macie"], "e":"GuardDuty uses ML to analyze CloudTrail, VPC Flow, and DNS logs for threats automatically."},
    {"id":70, "c":3, "q":"A company wants to enable cross-region replication on the S3 bucket. Which S3 feature should be enabled before cross-region replication can be used?", "a":"Versioning", "d": ["Encryption", "Static Website Hosting", "Logging", "Transfer Acceleration"], "e":"Versioning must be enabled on both source and destination buckets for Replication to work."},
    {"id":71, "c":2, "q":"What is the AWS service that performs automated network assessments of Amazon EC2 instances to check for vulnerabilities?", "a":"Amazon Inspector", "d": ["AWS Trusted Advisor", "AWS Shield", "AWS WAF", "Amazon GuardDuty"], "e":"Inspector checks for network reachability and software vulnerabilities."},
    {"id":72, "c":3, "q":"Which of the following are components of the site-to-site VPN connection? (Select TWO)", "a":"Virtual Private Gateway, Customer Gateway", "d": ["Internet Gateway", "NAT Gateway", "Egress Only Internet Gateway", "VPC Peering"], "e":"A Site-to-Site VPN consists of a VGW (AWS side) and a Customer Gateway (On-prem side)."},
    {"id":73, "c":3, "q":"Which AWS service enables developers and data scientists to quickly and easily build, train, and deploy machine learning models at any scale?", "a":"Amazon SageMaker", "d": ["Amazon Comprehend", "Amazon Rekognition", "Amazon Polly", "AWS DeepLens"], "e":"SageMaker is the end-to-end ML service."},
    {"id":74, "c":4, "q":"Which of the following strategies help analyze cost in AWS?", "a":"Use tags to group resources", "d": ["Use random naming conventions", "Delete all resources", "Use only free tier", "Ignore unused resources"], "e":"Tagging resources (e.g., CostCenter=101) allows you to allocate costs in billing reports."},
    {"id":75, "c":3, "q":"Which of the following is a fully managed extract, transform, and load (ETL) service that makes it easy for customers to prepare and load their data for analytics?", "a":"AWS Glue", "d": ["Amazon Athena", "Amazon EMR", "Amazon Redshift", "Amazon Kinesis"], "e":"AWS Glue is the serverless ETL service."},
    {"id":76, "c":3, "q":"Which service provides DNS in the AWS cloud?", "a":"Amazon Route 53", "d": ["VPC", "Direct Connect", "CloudFront", "ELB"], "e":"Route 53 is the Managed DNS service."},
    {"id":77, "c":4, "q":"You are System Administrator and your company's CEO has recently come to know about the benefits of the AWS Cloud. The CEO wants to find out the savings your company will make if they migrate to the AWS Cloud. Which AWS tool will you use to estimate savings?", "a":"AWS TCO Calculator (Migration Evaluator)", "d": ["AWS Simple Monthly Calculator", "AWS Cost Explorer", "AWS Budgets", "AWS Pricing Calculator"], "e":"TCO (Total Cost of Ownership) tools help compare the costs of running on-premises vs. AWS."},
    {"id":78, "c":3, "q":"Which AWS database service is best suited for non-relational databases?", "a":"Amazon DynamoDB", "d": ["Amazon RDS", "Amazon Redshift", "Amazon Aurora", "Amazon Neptune"], "e":"DynamoDB is the flagship NoSQL (non-relational) database."},
    {"id":79, "c":2, "q":"As part of security review, your company has decided to make users choose strong passwords. What is the most reliable way to ensure that users are using strong passwords?", "a":"Apply an IAM password policy", "d": ["Send email to all users", "Create a training video", "Use third-party software", "Manually check passwords"], "e":"IAM Password Policies enforce length, complexity, and rotation requirements."},
    {"id":80, "c":4, "q":"Which of the following procedures would you suggest reducing the Amazon S3 costs?", "a":"Use Lifecycle Policies to move data to correct storage classes", "d": ["Delete all data", "Store data on EC2", "Use EBS instead", "Compress data manually"], "e":"Lifecycle policies automate moving data to cheaper tiers (like Glacier) as it ages."},
    {"id":81, "c":1, "q":"How can ELBs improve the fault tolerance of your application?", "a":"By stopping traffic to unhealthy instances", "d": ["By increasing the speed of the instance", "By reducing the cost of the instance", "By encrypting data", "By storing backups"], "e":"ELBs perform health checks and only route traffic to healthy instances, masking failures from users."},
    {"id":82, "c":1, "q":"As part of the AWS Migration Acceleration Program (MAP), what does AWS provide to accelerate Enterprise adoption of AWS? (Select TWO)", "a":"AWS Professional Services, AWS Training", "d": ["Free hardware", "Unlimited credits", "Guaranteed success", "Pre-written code"], "e":"MAP provides methodology, tools, and expertise (ProServe/Training) to help migrate."},
    {"id":83, "c":2, "q":"Which of the following are part of AWS shared controls under the Amazon Shared Responsibility model? (Select TWO)", "a":"Patch Management, Awareness & Training", "d": ["Physical Security", "Network Security", "Data Encryption", "Hardware Maintenance"], "e":"Shared Controls apply to both: AWS patches infra, you patch OS. AWS trains their staff, you train yours."},
    {"id":84, "c":2, "q":"An organization has established a new department and hired a large number of employees who will require the same access to some of AWS services. What does AWS provide to help organize them so you do not need to assign permission to each employee individually?", "a":"IAM Groups", "d": ["IAM Roles", "IAM Policies", "IAM Users", "AWS Organizations"], "e":"Use IAM Groups to manage permissions for collections of users."},
    {"id":85, "c":3, "q":"An application needs to access data in another VPC in the same region. What would enable one VPC to be connected to another VPC?", "a":"VPC Peering", "d": ["VPN", "Direct Connect", "Internet Gateway", "NAT Gateway"], "e":"VPC Peering is a direct network connection between two VPCs."},
    {"id":86, "c":4, "q":"What will you include in the business case to attempt to satisfy everyone at the company regarding shifting capital expense to operating expense?", "a":"Suggest that the company make dedicated hosts or reserved instance purchases", "d": ["Suggest using only Spot Instances", "Suggest moving everything to S3", "Suggest firing IT staff", "Suggest using a different cloud provider"], "e":"Reserved Instances and Dedicated Hosts can often be treated as Capital Expenses (CapEx) for accounting purposes, bridging the gap."},
    {"id":87, "c":2, "q":"Which AWS service can you use to download the AWS PCI report?", "a":"AWS Artifact", "d": ["AWS Shield", "AWS Inspector", "AWS Macie", "AWS Trusted Advisor"], "e":"AWS Artifact is the portal for downloading compliance reports (PCI, SOC, ISO)."},
    {"id":88, "c":2, "q":"Which AWS service records the history of configuration changes for your resources to assist with auditing and compliance?", "a":"AWS Config", "d": ["AWS CloudTrail", "AWS CloudWatch", "AWS Systems Manager", "AWS Trusted Advisor"], "e":"AWS Config continuously monitors and records your AWS resource configurations and allows you to automate the evaluation of recorded configurations against desired configurations."},
    {"id":89, "c":2, "q":"In the AWS Shared responsibility Model, which of the following are the responsibility of the customer? (Select TWO)", "a":"Setting password complexity, Securing VPC (Security Groups)", "d": ["Physical security of data centers", "Disposal of disk drives", "Patching the hypervisor", "Maintaining network infrastructure"], "e":"Customer = Security IN the cloud (Data, Ports, Passwords)."},
    {"id":90, "c":2, "q":"Which AWS service provides Rate-based rule to mitigate layer 7 DDoS attack?", "a":"AWS WAF", "d": ["AWS Shield", "AWS Inspector", "Amazon GuardDuty", "AWS Firewall Manager"], "e":"WAF allows you to block IPs that send too many requests (Rate-based rules)."},
    {"id":91, "c":2, "q":"Which service can identify the user that made the API call when an Amazon EC2 instance is terminated?", "a":"AWS CloudTrail", "d": ["AWS CloudWatch", "AWS Config", "AWS Inspector", "AWS Trusted Advisor"], "e":"CloudTrail logs the identity of API callers."},
    {"id":92, "c":3, "q":"You are tasked with improving the performance of a blog with read-heavy traffic. Which feature of Amazon RDS will help you with it?", "a":"Read replicas", "d": ["Multi-AZ deployment", "Automated backups", "Storage autoscaling", "Encryption"], "e":"Read Replicas scale read operations. Multi-AZ is for High Availability (disaster recovery)."},
    {"id":93, "c":3, "q":"Which AWS service helps customers to easily collect, process, and analyse video and data streams in real-time?", "a":"Amazon Kinesis", "d": ["Amazon SQS", "Amazon SNS", "AWS Data Pipeline", "AWS Glue"], "e":"Kinesis is for streaming data (Kinesis Data Streams, Kinesis Video Streams)."},
    {"id":94, "c":3, "q":"Which of the following makes it easier for you to manage and filter your resources?", "a":"AWS Tagging", "d": ["AWS Config", "AWS CloudTrail", "AWS IAM", "AWS Organizations"], "e":"Tags act as metadata labels for organization and filtering."},
    {"id":95, "c":3, "q":"A highly scalable application generates record document for each customer which must remain available for immediate download for up to 3 months and then must be deleted. What is the most appropriate storage medium for this user case?", "a":"Amazon S3 with Lifecycle Policy", "d": ["Amazon EBS", "Amazon EFS", "Amazon Glacier", "EC2 instance store"], "e":"S3 is best for files/documents, and Lifecycle Policies handle the deletion automatically."},
    {"id":96, "c":2, "q":"In the AWS Shared responsibility Model, for which of the following does AWS not assume responsibility?", "a":"Customer Data", "d": ["Physical security", "Network infrastructure", "Virtualization layer", "Disk management"], "e":"AWS is never responsible for your data. That is the customer's responsibility."},
    {"id":97, "c":3, "q":"Which of the following automatically handles the deployment, from capacity provisioning, load balancing and auto-scaling but yet gives you full control over the AWS resources powering your application?", "a":"AWS Elastic Beanstalk", "d": ["AWS CloudFormation", "AWS OpsWorks", "AWS CodeDeploy", "AWS ECS"], "e":"Elastic Beanstalk is the 'Platform as a Service' (PaaS) offering that deploys resources you can still see/access."},
    {"id":98, "c":1, "q":"What are the benefits of the AWS Marketplace service? (Select TWO)", "a":"Quickly launch pre-configured software, Security scans on listed products", "d": ["Guaranteed 100% uptime", "Free hardware upgrades", "Automatic code refactoring", "Unlimited storage"], "e":"Marketplace offers speed (pre-made AMIs) and trust (AWS scans products)."},
    {"id":99, "c":3, "q":"A company wants to build and replicate its AWS infrastructure in multiple environments. Which AWS service provides the capability for the customer to use templates to describe and then automatically provision the infrastructure resources?", "a":"AWS CloudFormation", "d": ["AWS Elastic Beanstalk", "AWS OpsWorks", "AWS CodeDeploy", "AWS Systems Manager"], "e":"CloudFormation uses templates to define infrastructure."},
    {"id":100, "c":4, "q":"A company is migrating to the AWS Cloud and wants to bring their server-bound licenses. Which EC2 pricing model supports this?", "a":"Dedicated Host", "d": ["Dedicated Instance", "Reserved Instance", "Spot Instance", "On-Demand Instance"], "e":"Dedicated Hosts allow you to control the physical socket/core placement required for BYOL (Bring Your Own License)."},
    {"id":101, "c":2, "q":"A company uses EBS volumes to store critical and confidential data hosted on their EC2 instances. A new mandate has been released requiring the company to encrypt data at rest. Which of the following can be used to meet this requirement?", "a":"AWS KMS", "d": ["AWS Shield", "AWS WAF", "AWS Inspector", "AWS Macie"], "e":"KMS manages the encryption keys for EBS volumes."},
    {"id":102, "c":2, "q":"According to the AWS Acceptable Use Policy, which of the following statements is true regarding penetration testing of EC2 instances?", "a":"Customer can perform penetration testing on their own instances without prior approval for allowed services", "d": ["Penetration testing is strictly prohibited", "You must always get prior approval", "Only AWS can perform penetration testing", "You can only test during business hours"], "e":"AWS now allows pen-testing on common services (EC2, RDS, etc.) without prior approval, provided rules of engagement are followed."},
    {"id":103, "c":3, "q":"Company ABC has been experiencing issues with their Data Centre and has been advised to migrate some of their services to the AWS cloud. They want to use the AWS cloud as an extension to their Data Centre. Which AWS services can they use to establish the network connection? (Select TWO)", "a":"AWS Direct Connect, AWS Site-to-Site VPN", "d": ["VPC Peering", "Internet Gateway", "NAT Gateway", "Transit Gateway"], "e":"Hybrid connectivity is best achieved via VPN (IPsec) or Direct Connect (Physical)."},
    {"id":104, "c":3, "q":"You are writing an application which runs on EC2 instances and stores an object of size 3 GB in an S3 bucket. You want to minimize the time required to upload each item. Which API should you use to minimise upload time?", "a":"Multipart Upload", "d": ["Single PUT Upload", "Transfer Acceleration", "S3 Select", "Batch Operations"], "e":"Multipart Upload is recommended for files >100MB and speeds up uploads by parallelizing them."},
    {"id":105, "c":2, "q":"Which of the following AWS security resources are available to any user for free? (Select THREE)", "a":"AWS Technical Guides, AWS Security Blog, AWS Whitepapers", "d": ["AWS Professional Services", "AWS Enterprise Support", "AWS Trusted Advisor (Full)", "AWS Shield Advanced"], "e":"Documentation, blogs, and whitepapers are free public resources."},
    {"id":106, "c":2, "q":"Which of the following AWS services can help you perform security assessment and regulatory compliance auditing? (Select TWO)", "a":"AWS Config, Amazon Inspector", "d": ["AWS Shield", "AWS WAF", "Amazon GuardDuty", "AWS Macie"], "e":"Config records history for auditing; Inspector scans for vulnerabilities."},
    {"id":107, "c":2, "q":"You suspect that AWS resources are being used for malicious activity (e.g. spam, port scanning). How can you let AWS know?", "a":"Report to AWS Abuse team", "d": ["Contact AWS Support", "Post on AWS Forums", "Tweet at AWS", "Email the CEO"], "e":"The AWS Abuse Team investigates reports of prohibited use (attacks originating FROM AWS)."},
    {"id":108, "c":2, "q":"According to the AWS Shared Responsibility Model, for which of the following is the customer responsible? (Select THREE)", "a":"Guest OS Patching, Security Groups, Network Access Control Lists", "d": ["Physical Security", "Hypervisor Patching", "Disk Disposal", "Network Infrastructure"], "e":"Customer manages the Guest OS, Firewall configuration (SG/NACL), and Data."},
    {"id":109, "c":2, "q":"Which AWS service provides hardware security modules (HSMs) to protect your encryption keys?", "a":"AWS CloudHSM", "d": ["AWS WAF", "AWS Shield", "Amazon GuardDuty", "AWS Secrets Manager"], "e":"AWS CloudHSM provides hardware-based key storage for regulatory compliance."},
    {"id":110, "c":4, "q":"Which of the following are TRUE about AWS Organizations service? (Select TWO)", "a":"Unused reserved instances can be shared across the group, Consolidated billing allows you to get volume discounts", "d": ["It replaces IAM", "It is only for large enterprises", "It costs extra", "It provides free support"], "e":"Organizations allows sharing of RI benefits and combining usage for volume discounts."},
    {"id":111, "c":1, "q":"A company has developed a web application in AWS. What should they do to ensure that the application is highly available?", "a":"Deploy the application across multiple Availability Zones", "d": ["Deploy the application on a single large instance", "Use only Spot Instances", "Back up data to tape", "Use a single Availability Zone"], "e":"Multi-AZ deployment is the cornerstone of High Availability in AWS."},
    {"id":112, "c":3, "q":"Which of the following statements is true of AWS regions? (Select TWO)", "a":"They are composed of Availability Zones, They are physical locations around the world", "d": ["They are logically isolated sections of the cloud", "They are edge locations", "They are always connected via high-speed links", "They are backup sites"], "e":"Regions are physical locations containing multiple Availability Zones."},
    {"id":113, "c":2, "q":"Amazon GuardDuty is a threat detection service. Which data sources GuardDuty analyse? (Select THREE)", "a":"AWS CloudTrail logs, DNS logs, VPC Flow Logs", "d": ["S3 Data Events", "ELB Access Logs", "DynamoDB Streams", "RDS Logs"], "e":"GuardDuty's core sources are CloudTrail, VPC Flow Logs, and DNS Logs."},
    {"id":114, "c":1, "q":"What are the main benefits of using the AWS Service Catalog?", "a":"Enable users to quickly deploy approved IT services", "d": ["Reduce the cost of AWS services", "Automate the creation of AWS accounts", "Monitor the performance of AWS services", "Secure AWS resources"], "e":"Service Catalog restricts users to deploying only pre-approved CloudFormation templates."},
    {"id":115, "c":4, "q":"AWS Organizations enables you to set up consolidated billing across multiple AWS accounts.", "a":"AWS Organizations", "d": ["AWS Cost Explorer", "AWS Budgets", "AWS Billing Dashboard", "AWS Trusted Advisor"], "e":"Consolidated Billing is a primary feature of AWS Organizations."},
    {"id":116, "c":4, "q":"Which of the following are the factors which influence CloudFront cost? (Select THREE)", "a":"Number of Requests, Data Transfer OUT, Traffic Distribution (Region)", "d": ["Data Transfer IN", "Number of Distributions", "Storage Used", "Compute Time"], "e":"You pay for Data Out, Requests, and geographic location of the user."},
    {"id":117, "c":4, "q":"A customer has a high availability application running on an EC2 instance which frequently writes to persistent storage. Which AWS pricing model will provide the LOWEST costs for computing resources?", "a":"Reserved Instances (or Savings Plans)", "d": ["On-Demand Instances", "Spot Instances", "Dedicated Hosts", "Dedicated Instances"], "e":"For steady-state applications that cannot be interrupted (persistent storage/HA implies production stability), Reserved Instances provide the best discount. Spot is cheaper but risks interruption."},
    {"id":118, "c":2, "q":"You have added a new employee to the 'Finance' IAM group. Which of the following statements apply to that user?", "a":"Employee will inherit the permissions of 'Finance' IAM group", "d": ["Employee will need to be assigned permissions manually", "Employee will have full admin access", "Employee will have no access", "Employee will need to create a new account"], "e":"Permissions are inherited from the Group."},
    {"id":119, "c":3, "q":"Which of the following are TRUE about Amazon S3?", "a":"The total volume of data and number of objects you can store are unlimited, Files can be from 0 bytes to 5 TB", "d": ["S3 is a block storage service", "S3 is a file storage service", "S3 is only for backup", "S3 has a limit on the number of objects"], "e":"S3 has unlimited total storage. Individual objects max out at 5 TB. It is Object Storage, not Block or File."},
    {"id":120, "c":1, "q":"What are the advantages of using AWS over an on-premises data center? (Select TWO)", "a":"Go global in minutes, Increase speed and agility", "d": ["Total control over hardware", "Physical access to servers", "Lower latency for local users", "Customizable hardware"], "e":"Cloud offers Speed/Agility and Global Reach."},
    {"id":121, "c":2, "q":"A company has a VPC with a private and public subnet. They want to enable instances in a private subnet to connect to the internet to be able to install security patches. What is the MOST secure way to enable this?", "a":"NAT Gateway", "d": ["Internet Gateway", "Egress Only Internet Gateway", "VPC Peering", "VPN Gateway"], "e":"NAT Gateway allows outbound internet access for private subnets while blocking inbound traffic."},
    {"id":122, "c":2, "q":"Which type of IAM policy is attached to a resource, such as an S3 bucket, to control who can access it?", "a":"Resource-based policy", "d": ["Identity-based policy", "Permissions boundary", "Service Control Policy (SCP)", "Access Control List (ACL)"], "e":"Resource-based policies (like Bucket Policies) are attached directly to the resource itself, unlike Identity-based policies which attach to Users/Roles."},
    {"id":123, "c":3, "q":"Which of the following is the most appropriate means for developers to store Docker container images in the AWS Cloud?", "a":"Amazon Elastic Container Registry (Amazon ECR)", "d": ["Amazon S3", "Amazon EBS", "Amazon EFS", "AWS CodeCommit"], "e":"ECR is the managed registry for Docker images."},
    {"id":124, "c":2, "q":"You have been asked to enable AWS IAM Identity Center (formerly SSO); which service should already be set up on the account?", "a":"AWS Organizations", "d": ["AWS IAM", "AWS Directory Service", "AWS Cognito", "AWS STS"], "e":"IAM Identity Center (SSO) requires AWS Organizations."},
    {"id":125, "c":2, "q":"A company wants to centrally manage policies across all of their AWS accounts; which AWS service will allow this?", "a":"AWS Organizations", "d": ["AWS IAM", "AWS Config", "AWS CloudTrail", "AWS Trusted Advisor"], "e":"Service Control Policies (SCPs) in AWS Organizations allow central policy management."},
    {"id":126, "c":3, "q":"A company has 100Mbps connection and they can use it at 80% capacity to transfer 100TB data from their premise over to AWS S3. What is the MOST cost-effective and FASTER method to achieve this?", "a":"AWS Snowball Edge", "d": ["Direct Connect", "VPN", "S3 Transfer Acceleration", "Internet Upload"], "e":"At 80Mbps, 100TB takes months. Snowball is physically faster (days) and cheaper."},
    {"id":127, "c":4, "q":"What does AWS Cost Explorer provide to help manage your AWS spend?", "a":"Forecasting future costs", "d": ["Real-time alerting", "Automatic cost reduction", "Free credits", "Tax advice"], "e":"Cost Explorer uses historical data to forecast future spend."},
    {"id":128, "c":4, "q":"You are asked to set up a batch job that runs every Friday night. The job completes in less than 100 minutes and cannot be postponed. Which Amazon EC2 payment model should you use for the best price?", "a":"Scheduled Reserved Instances (or On-Demand Capacity Reservations)", "d": ["On-Demand Instance", "Spot Instance", "Dedicated Host", "Convertible Reserved Instance"], "e":"A job that 'cannot be postponed' on a recurring schedule needs capacity assurance. Scheduled RIs (or ODCRs) provide this. Spot is unsafe; standard On-Demand is more expensive."},
    {"id":129, "c":3, "q":"You are using Amazon RDS for MySQL, which of the following features performs automatic failover when the primary database fails to respond?", "a":"Multi-AZ Deployment", "d": ["Read Replicas", "Automated Backups", "Snapshots", "Encryption"], "e":"Multi-AZ automatically fails over to the standby instance."},
    {"id":130, "c":3, "q":"Which of the following AWS Services helps customers plan migration projects by gathering information about their on-premises data centers?", "a":"AWS Application Discovery Service", "d": ["AWS Migration Hub", "AWS Server Migration Service", "AWS Database Migration Service", "AWS Snowball"], "e":"Application Discovery Service collects server specs and usage data."},
    {"id":131, "c":3, "q":"You are asked to make an image file publicly available on the web. This file will be downloaded by customers using their browser hundreds of thousands of times. Which option will be the most cost-effective?", "a":"Store the file in Amazon S3 Standard", "d": ["Store the file in Amazon EBS", "Store the file in Amazon EFS", "Store the file on an EC2 instance", "Store the file in Amazon Glacier"], "e":"S3 is designed for high-scale public web delivery. It is cheaper than EC2/EBS for this use case."},
    {"id":132, "c":3, "q":"Which of the following AWS computing services is serverless?", "a":"AWS Lambda", "d": ["Amazon EC2", "Amazon ECS", "AWS Elastic Beanstalk", "Amazon Lightsail"], "e":"Lambda is the definition of Serverless Compute."},
    {"id":133, "c":4, "q":"What support does the Enterprise Concierge Team provide?", "a":"Help with billing and account inquiries", "d": ["Technical support", "Architecture guidance", "Code debugging", "Security assessment"], "e":"Concierge is the 'white glove' billing/account support for Enterprise plans."},
    {"id":134, "c":2, "q":"Which AWS service makes it easy for you to create and manage cryptographic keys and control their use across a wide range of AWS services and in your applications?", "a":"AWS KMS", "d": ["AWS Secrets Manager", "AWS Certificate Manager", "AWS Shield", "AWS WAF"], "e":"KMS is for encryption keys. (Secrets Manager is for passwords/credentials)."},
    {"id":135, "c":2, "q":"What are AWS shared controls?", "a":"Controls which apply to both the infrastructure layer and customer layers", "d": ["Controls that are shared between AWS customers", "Controls that are optional", "Controls that are managed by third parties", "Controls that are deprecated"], "e":"Example: AWS provides awareness training to its employees, and you provide it to yours."},
    {"id":136, "c":1, "q":"With AWS services, you can use as many resources as you need, as well as use them when you need them. Which of the following terms can be applied to this concept? (Select TWO)", "a":"Elasticity, Disposable resources", "d": ["Fixed resources", "Permanent resources", "Static resources", "Reserved resources"], "e":"Elasticity is the scaling; Disposable resources is the mindset enabled by it."},
    {"id":137, "c":3, "q":"Which of the following AWS services should you use to migrate an existing database to AWS?", "a":"AWS Database Migration Service (DMS)", "d": ["SMS", "Snowball", "DataSync", "Transfer Family"], "e":"DMS is specifically for database migration."},
    {"id":138, "c":1, "q":"Which of the following are benefits of using the AWS Cloud? (Select TWO)", "a":"Stop guessing capacity, Increased speed and agility", "d": ["Total control over physical hardware", "Manual scaling", "Long-term contracts", "Fixed costs"], "e":"Standard AWS value props: Agility and Elasticity."},
    {"id":139, "c":4, "q":"Which of the following affect Amazon EBS pricing? (Select THREE)", "a":"Volume size, Region, IOPS (for provisioned types)", "d": ["Data Transfer IN", "Number of Instances", "Availability Zone", "VPC ID"], "e":"EBS pricing is based on Size (GB), Region, and Speed (IOPS) for advanced types."},
    {"id":140, "c":3, "q":"Which of the following are a collection of data centers within a specific region?", "a":"Availability Zones", "d": ["Edge Locations", "VPCs", "Subnets", "Placement Groups"], "e":"AZs contain one or more data centers."},
    {"id":141, "c":3, "q":"Which of the following AWS services facilitate the implementation of loosely coupled architectures? (Select TWO)", "a":"Amazon SQS, Elastic Load Balancing", "d": ["Amazon EC2", "Amazon EBS", "Amazon RDS", "AWS Lambda"], "e":"SQS buffers messages; ELB distributes traffic. Both reduce dependencies."},
    {"id":142, "c":3, "q":"Which of the following consist of a customer-defined key and an optional value that can make it easier to manage, search for, and filter resources?", "a":"Tags", "d": ["AWS Config", "AWS CloudTrail", "AWS IAM", "AWS Organizations"], "e":"Tags are Key-Value pairs."},
    {"id":143, "c":4, "q":"What does the AWS Total Cost of Ownership (TCO) Calculator provide?", "a":"Comparison of on-premises vs AWS costs", "d": ["Monthly bill estimation", "Real-time cost tracking", "Budget alerts", "Pricing for specific services"], "e":"TCO is for 'What if we move to cloud?' analysis."},
    {"id":144, "c":3, "q":"A client wants to use an Elastic Load Balancer which is capable of handling millions of requests per second with ultra-low latency. Which load balancer is most suitable?", "a":"Network Load Balancer", "d": ["Application Load Balancer", "Classic Load Balancer", "Gateway Load Balancer", "Elastic Load Balancer"], "e":"NLB works at Layer 4 and is built for extreme performance."},
    {"id":145, "c":2, "q":"Which of the following AWS Identity and Access Management (IAM)'s best practice adds an extra layer of protection?", "a":"Enable MFA on the Root User", "d": ["Share root credentials", "Use simple passwords", "Disable MFA", "Use only one access key"], "e":"Protecting the Root user with MFA is critical."},
    {"id":146, "c":4, "q":"A company is trying to analyze the costs applied to their AWS account recently. Which of the following lists AWS usage for each service category used by an account and its IAM users?", "a":"AWS Cost & Usage Report (CUR)", "d": ["AWS Billing Dashboard", "AWS Cost Explorer", "AWS Budgets", "AWS Trusted Advisor"], "e":"CUR is the most granular data feed available."},
    {"id":147, "c":3, "q":"A company currently uses VM Templates to spin up virtual machines on their on-premise infrastructure. Which of the following can be used to provision another EC2 instance with identical configuration?", "a":"Amazon Machine Image (AMI)", "d": ["Snapshots", "Volumes", "Elastic IP", "Key Pairs"], "e":"AMIs act as the template (OS + Software) for EC2."},
    {"id":148, "c":1, "q":"A company has an application that is deployed on servers hosted in their office server room. They are looking to grow their organization's infrastructure by connecting cloud resources to the internal system. What type of deployment model will they be adopting?", "a":"Hybrid Cloud", "d": ["Public", "Private", "Community", "Multi-cloud"], "e":"Connecting On-Prem + Cloud = Hybrid."},
    {"id":149, "c":3, "q":"What are the AWS services or features that can help you maintain fault-tolerant and highly available architecture in AWS? (Select TWO)", "a":"Auto Scaling, Elastic Load Balancing", "d": ["Amazon S3", "Amazon EBS", "Amazon RDS", "AWS Lambda"], "e":"The dynamic duo of HA/FT: ELB distributes load, Auto Scaling recovers lost instances."},
    {"id":150, "c":3, "q":"A company has developed a media playback application but some of the devices are showing 'format not supported' error. Which of the following AWS services can help them with this issue?", "a":"AWS Elemental MediaConvert", "d": ["Amazon Elastic Transcoder", "Amazon Kinesis Video Streams", "Amazon Rekognition", "Amazon Polly"], "e":"MediaConvert is the modern file-based video transcoding service. (Elastic Transcoder is legacy)."},
    {"id":151, "c":3, "q":"Which of the following services is an AWS repository management system that allows for storing, versioning, and managing your application code?", "a":"AWS CodeCommit", "d": ["AWS CodeBuild", "AWS CodeDeploy", "AWS CodePipeline", "GitHub"], "e":"CodeCommit is AWS's managed Git service."},
    {"id":152, "c":2, "q":"Under the Shared Responsibility Model, which of the following are responsibilities of AWS?", "a":"Securing physical infrastructure", "d": ["Securing customer data", "Managing user access", "Patching guest OS", "Configuring firewalls"], "e":"AWS = Security OF the Cloud (Concrete, Cables, Hardware)."},
    {"id":153, "c":3, "q":"Which service can you use to set alarms to monitor AWS resources?", "a":"AWS CloudWatch", "d": ["AWS CloudTrail", "AWS Config", "AWS Inspector", "AWS Trusted Advisor"], "e":"CloudWatch Alarms trigger based on metrics (e.g., CPU > 80%)."},
    {"id":154, "c":3, "q":"Which service can you use to route traffic to the endpoint that provides the best application performance for your users worldwide?", "a":"AWS Global Accelerator", "d": ["Amazon Route 53", "Amazon CloudFront", "Elastic Load Balancer", "AWS Direct Connect"], "e":"Global Accelerator optimizes pathing over the AWS backbone to reduce latency/jitter."},
    {"id":155, "c":3, "q":"CloudFront is used to route users to the edge location that provides the lowest amount of time delay in delivering content. Which of the following terms describes this 'time delay'?", "a":"Latency", "d": ["Bandwidth", "Throughput", "Jitter", "Packet Loss"], "e":"Latency is the delay."},
    {"id":156, "c":3, "q":"Which tool or service can be used to list the number of Lambda functions in an account?", "a":"AWS CLI", "d": ["AWS SDK", "AWS Management Console", "AWS CloudFormation", "AWS Config"], "e":"CLI allows listing resources via commands."},
    {"id":157, "c":1, "q":"Which of the following are building blocks of a fault-tolerant system? (Select TWO)", "a":"Amazon SQS, Amazon S3", "d": ["Amazon EC2", "Amazon EBS", "Amazon RDS", "AWS Lambda"], "e":"SQS (Decoupling) and S3 (Durable storage) help build systems that withstand failure."},
    {"id":158, "c":3, "q":"Which services work together to enable auto-scaling of Amazon EC2 instances?", "a":"Auto Scaling, ELB, CloudWatch", "d": ["Amazon S3, Amazon EBS, Amazon RDS", "AWS Lambda, API Gateway, DynamoDB", "AWS IAM, AWS STS, AWS Cognito", "AWS CloudFormation, AWS OpsWorks, AWS Systems Manager"], "e":"CloudWatch monitors -> Alarm triggers Auto Scaling -> ELB registers new instance."},
    {"id":159, "c":4, "q":"What does the term 'Economies of scale' mean?", "a":"AWS continuously lowers costs as it grows", "d": ["AWS increases prices as it grows", "AWS prices remain constant", "AWS prices depend on the user", "AWS prices are random"], "e":"AWS aggregates usage from millions of customers to get better hardware pricing, passing savings to you."},
    {"id":160, "c":1, "q":"Which of the following AWS offering allows customers to find, buy, and immediately start using software solutions in their AWS environment?", "a":"AWS Marketplace", "d": ["AWS Service Catalog", "AWS AppStore", "Amazon Store", "AWS Partner Network"], "e":"The Marketplace is the 'App Store' for server software/SaaS."},
    {"id":161, "c":3, "q":"What is the size of the CIDR block you are permitted in an AWS VPC?", "a":"/16 to /28", "d": ["/8 to /32", "/24 to /32", "/0 to /16", "/12 to /24"], "e":"VPC sizing rules: Max /16 (65k IPs), Min /28 (16 IPs)."},
    {"id":162, "c":3, "q":"You have a real-time application that requires sub-millisecond latency. Which of the following services would you use?", "a":"Amazon ElastiCache", "d": ["Amazon DynamoDB", "Amazon RDS", "Amazon Redshift", "Amazon S3"], "e":"ElastiCache (Redis/Memcached) provides microsecond/sub-millisecond latency. DynamoDB is single-digit millisecond."},
    {"id":163, "c":3, "q":"AWS Global Accelerator provides cross-region traffic management using the AWS backbone network.", "a":"True", "d": ["False"], "e":"Global Accelerator uses the high-speed AWS backbone, bypassing the public internet."},
    {"id":164, "c":2, "q":"A company is hosting an application on an EC2 instance. They want to add a new feature where users can upload their files to the S3 bucket.", "a":"Create an IAM Role with write permissions and attach it to the EC2 instance", "d": ["Store credentials in the application code", "Store credentials in a file on the instance", "Use environment variables", "Use the root account credentials"], "e":"IAM Roles are the secure way to grant EC2 instances permissions."},
    {"id":165, "c":2, "q":"A company has won a big project and has hired new employees, who are split into teams with separate permissions for each team. You have been asked to create IAM users and implement the permissions accordingly. How will you implement this?", "a":"Create IAM Groups for each team and assign policies to the groups", "d": ["Create a separate IAM user for each employee", "Create a single IAM user for all employees", "Share the root account credentials", "Use IAM Roles"], "e":"Groups are for collections of users (Teams)."},
    {"id":166, "c":4, "q":"You are using AWS Organizations and set up consolidated billing. If Reserved Instance sharing is NOT turned on for an account, which is true?", "a":"Reserved Instance discounts apply only to the account that purchased them", "d": ["Reserved Instance discounts apply to all accounts", "Reserved Instance discounts are lost", "Reserved Instance discounts are applied to the master account", "Reserved Instance discounts are applied to the newest account"], "e":"If sharing is disabled, the benefit remains local to the purchasing account."},
    {"id":167, "c":4, "q":"You are launching a new application but want to be alerted when your cost or usage amount exceeds a threshold. Which AWS service will enable you to set alarms to meet this requirement?", "a":"AWS Budgets", "d": ["AWS Cost Explorer", "AWS Billing Dashboard", "AWS Trusted Advisor", "AWS Config"], "e":"AWS Budgets sends alerts (email/SNS) when you exceed your defined thresholds."},
    {"id":168, "c":1, "q":"What is the key difference between an availability zone and an edge location?", "a":"Availability Zones run your main infrastructure (EC2/RDS); Edge Locations cache content (CloudFront)", "d": ["Edge Locations are larger than Availability Zones", "Availability Zones are located in Edge Locations", "Edge Locations are for storage only", "Availability Zones are for compute only"], "e":"AZ = Data Centers for Compute/Storage. Edge = Caching points for CDN."},
    {"id":169, "c":3, "q":"What AWS tools can be used to call AWS Services from different programming languages?", "a":"AWS SDK (Software Development Kit)", "d": ["AWS CLI", "AWS Management Console", "AWS CloudFormation", "AWS Config"], "e":"SDKs (Boto3, AWS SDK for Java, etc.) enable code-based interaction."},
    {"id":170, "c":2, "q":"According to the AWS Customer Service Policy for Penetration testing, which of the following activities are NOT permitted? (Select THREE)", "a":"DNS zone walking, Simulated DDoS, Protocol flooding", "d": ["Port scanning your own instances", "Vulnerability scanning", "Configuration review", "Application fuzzing"], "e":"You cannot attack the AWS infrastructure itself (DDoS, Protocol Flooding) or try to map it out (DNS Zone Walking)."},
    {"id":171, "c":1, "q":"Which AWS framework helps organizations understand how cloud adoption transforms the way they work, and provides structure to identify and address gaps in skills and processes?", "a":"AWS Cloud Adoption Framework (AWS CAF)", "d": ["AWS Well-Architected Framework", "AWS Shared Responsibility Model", "AWS Global Infrastructure", "AWS Trusted Advisor"], "e":"AWS CAF groups capabilities into six perspectives (Business, People, Governance, Platform, Security, Operations) to help plan migration."},
    {"id":172, "c":1, "q":"The AWS Well-Architected Framework has six pillars. Which pillar focuses on minimizing the environmental impacts of running cloud workloads?", "a":"Sustainability", "d": ["Reliability", "Performance Efficiency", "Cost Optimization", "Operational Excellence"], "e":"The Sustainability pillar focuses on minimizing the environmental impact (energy consumption, carbon footprint) of cloud workloads."},
    {"id":173, "c":4, "q":"Which AWS service analyzes configuration and utilization metrics to make recommendations for rightsizing EC2 instances and other resources to lower costs and improve performance?", "a":"AWS Compute Optimizer", "d": ["AWS Cost Explorer", "AWS Budgets", "AWS Systems Manager", "AWS Auto Scaling"], "e":"Compute Optimizer uses machine learning to analyze history and recommend optimal resource configurations (Rightsizing)."},
    {"id":174, "c":2, "q":"A company wants to set up a secure, compliant, multi-account environment based on AWS best practices with a pre-configured landing zone. Which service should they use?", "a":"AWS Control Tower", "d": ["AWS Organizations", "AWS Config", "AWS IAM", "AWS Shield"], "e":"AWS Control Tower automates the setup of a landing zone (multi-account environment) using best practices and guardrails."},
    {"id":175, "c":3, "q":"Which AWS service allows you to deploy applications at the edge of 5G networks to minimize latency for mobile devices?", "a":"AWS Wavelength", "d": ["AWS Local Zones", "AWS Outposts", "Amazon CloudFront", "AWS Global Accelerator"], "e":"AWS Wavelength embeds AWS compute and storage inside telecom providers' 5G networks for ultra-low latency mobile apps."},
    {"id":176, "c":2, "q":"What tasks can only be done using root user credentials? (Select TWO)", "a":"Create a CloudFront key pair, Register as a seller in the Reserved Instance Marketplace", "d": ["Create IAM users", "Provisions new resources", "Delete S3 buckets", "Stop EC2 instances"], "e":"Certain account-level tasks are restricted to the root user, including creating CloudFront key pairs (for signed URLs) and registering as a seller in the Reserved Instance Marketplace."},
    {"id":177, "c":3, "q":"Which of the following AWS services supports cross-region data replication? (Select TWO)", "a":"Amazon Simple Storage Service, Amazon RDS", "d": ["Amazon Storage Gateway", "Amazon Macie", "Amazon CloudWatch", "AWS Lambda"], "e":"Amazon S3 supports Cross-Region Replication (CRR) for objects, and Amazon RDS supports creating Read Replicas in different regions for disaster recovery and local performance."},
    {"id":178, "c":1, "q":"Which of the following AWS services are free to use? (Select TWO)", "a":"Amazon Elastic Beanstalk, CloudFormation", "d": ["Amazon RDS", "Amazon EC2", "CloudWatch", "AWS Config"], "e":"Elastic Beanstalk and CloudFormation are free orchestration services. You do not pay for the service itself, only for the underlying resources (like EC2 instances and Load Balancers) they create."},
    {"id":179, "c":2, "q":"You have been tasked to create a new IAM user for a new developer who has recently joined your team. Although the user has received all the credentials, she still cannot perform any actions on the Amazon DynamoDB shop table. What can you do to resolve this issue? (Select TWO)", "a":"Create an identity-based policy, Add the user to the group that has the necessary permissions policy", "d": ["Reset password", "Double-check the credentials you sent to the user", "Create a ticket with AWS helpdesk as DynamoDB service has an underlying issue"], "e":"By default, new IAM users have no permissions (implicit deny). To grant access, you must explicitly attach a policy to the user (identity-based) or add them to a group that already has the required policy."},
    {"id":180, "c":3, "q":"Which feature enables you to connect multiple site-to-site VPN connections to a single gateway, allowing your remote sites to communicate with each other?", "a":"AWS VPN CloudHub", "d": ["AWS Transit Gateway", "AWS Direct Connect Gateway", "VPC Peering", "AWS Global Accelerator"], "e":"AWS VPN CloudHub operates on a simple hub-and-spoke model that you can use with or without a VPC. It allows multiple sites to communicate via the AWS VPN endpoint."},
    {"id":181, "c":4, "q":"Which of the following affect Amazon EBS pricing? (Select THREE)", "a":"Snapshots, Volume Type, Fast Snapshot Restore", "d": ["Elastic IPs", "RAM", "VPC ID"], "e":"EBS pricing is determined by the volume type (performance), storage capacity, snapshots (storage), and optional features like Fast Snapshot Restore."},
    {"id":182, "c":2, "q":"Which IAM entity can best be used to grant temporary access to your AWS resources? (Select TWO)", "a":"Access Keys, IAM Roles", "d": ["IAM Groups", "IAM Users", "MFA Tokens"], "e":"IAM Roles provide temporary security credentials. While standard Access Keys are long-term, STS generates temporary Access Keys/Session Tokens."},
    {"id":183, "c":2, "q":"According to the AWS Shared Responsibility Model, for which of the following is the customer responsible? (Select THREE)", "a":"NAT Instance, Security Groups, Network Access Control Lists", "d": ["AWS DynamoDB", "VPC Service", "Physical Security"], "e":"Customers are responsible for 'Security in the Cloud', which includes configuring firewalls (SG/NACLs) and managing guest OS/software on EC2 instances (like a NAT Instance)."},
    {"id":184, "c":2, "q":"Which AWS service uses machine learning to automatically discover, classify, and protect sensitive data (such as PII) stored in Amazon S3?", "a":"Amazon Macie", "d": ["Amazon GuardDuty", "AWS Shield", "Amazon Inspector", "AWS WAF"], "e":"Amazon Macie is a data security service that discovers sensitive data (like credit card numbers) in S3 using ML."},
    {"id":185, "c":3, "q":"Which serverless compute engine for containers allows you to run containers without managing the underlying EC2 instances?", "a":"AWS Fargate", "d": ["Amazon EC2", "Amazon Lightsail", "AWS Lambda", "Amazon Aurora"], "e":"AWS Fargate is the serverless compute engine for ECS and EKS that removes the need to provision or manage servers."},
    {"id":186, "c":3, "q":"Which AWS database is a fully managed relational database engine that offers the performance of commercial databases and is compatible with MySQL and PostgreSQL?", "a":"Amazon Aurora", "d": ["Amazon DynamoDB", "Amazon Redshift", "Amazon ElastiCache", "Amazon Neptune"], "e":"Amazon Aurora is a high-performance, cloud-native relational database (part of RDS) compatible with MySQL and PostgreSQL."},
    {"id":187, "c":2, "q":"Which service helps you rotate, manage, and retrieve database credentials, API keys, and other secrets throughout their lifecycle?", "a":"AWS Secrets Manager", "d": ["AWS Systems Manager", "AWS Shield", "Amazon Macie", "AWS Artifact"], "e":"Secrets Manager is specifically designed to centrally manage and automatically rotate secrets (like DB passwords)."},
    {"id":188, "c":3, "q":"A company wants to analyze data stored in Amazon S3 using standard SQL queries without provisioning servers. Which service should they use?", "a":"Amazon Athena", "d": ["Amazon Redshift", "Amazon Aurora", "AWS Glue", "Amazon EMR"], "e":"Amazon Athena is an interactive query service that makes it easy to analyze data in S3 using standard SQL."},
    {"id":189, "c":2, "q":"Which service provides user sign-up, sign-in, and access control for web and mobile applications?", "a":"Amazon Cognito", "d": ["AWS IAM", "AWS Directory Service", "AWS Organizations", "AWS SSO"], "e":"Amazon Cognito handles customer identity and access management (CIAM) for your apps (User Pools)."},
    {"id":190, "c":3, "q":"Which AWS service allows you to run AWS infrastructure and services on-premises for a truly consistent hybrid experience?", "a":"AWS Outposts", "d": ["AWS Direct Connect", "AWS Storage Gateway", "AWS VPN", "AWS Snowball"], "e":"AWS Outposts brings native AWS infrastructure (racks/servers) to your on-premises data center."},
    {"id":191, "c":3, "q":"Which AWS tool provides a personalized view of the health of the specific AWS services that are powering your workloads?", "a":"AWS Personal Health Dashboard", "d": ["AWS Service Health Dashboard", "AWS CloudWatch", "AWS Inspector", "AWS Trusted Advisor"], "e":"The Personal Health Dashboard gives you a view of AWS health specific to *your* resources, whereas the Service Health Dashboard is general."},
    {"id":192, "c":3, "q":"A developer wants to analyze and debug a distributed application to understand performance bottlenecks. Which AWS service helps with this?", "a":"AWS X-Ray", "d": ["AWS CloudTrail", "AWS Config", "Amazon CloudWatch", "AWS Systems Manager"], "e":"AWS X-Ray provides end-to-end tracing and debugging for distributed applications."},
    {"id":193, "c":3, "q":"Which scalable file storage service supports the Network File System (NFS) protocol and can be mounted concurrently by multiple EC2 instances?", "a":"Amazon EFS", "d": ["Amazon EBS", "Amazon S3", "Amazon S3 Glacier", "AWS Snowball"], "e":"Amazon EFS (Elastic File System) provides shared file storage for Linux instances via NFS."},
    {"id":194, "c":3, "q":"Which AWS service allows you to create and publish interactive business intelligence dashboards?", "a":"Amazon QuickSight", "d": ["Amazon Athena", "Amazon Kinesis", "AWS Glue", "Amazon OpenSearch"], "e":"Amazon QuickSight is the AWS Business Intelligence (BI) service for visualizing data."},
    {"id":195, "c":3, "q":"Which service enables developers, scientists, and engineers to easily and efficiently run hundreds of thousands of batch computing jobs on AWS?", "a":"AWS Batch", "d": ["AWS Lambda", "Amazon EC2 Auto Scaling", "AWS Fargate", "Amazon Lightsail"], "e":"AWS Batch dynamically provisions the optimal quantity and type of compute resources for batch jobs."},
    {"id":196, "c":3, "q":"Which AWS service automates code deployments to any instance, including Amazon EC2 instances and on-premises servers?", "a":"AWS CodeDeploy", "d": ["AWS CodeBuild", "AWS CodeCommit", "AWS CodePipeline", "AWS CloudFormation"], "e":"AWS CodeDeploy automates the actual deployment of code to compute resources."},
    {"id":197, "c":3, "q":"Which AWS service provides a unified user interface so you can view operational data and automate operational tasks across your AWS resources?", "a":"AWS Systems Manager", "d": ["AWS Config", "AWS CloudTrail", "AWS Organizations", "AWS Trusted Advisor"], "e":"Systems Manager (SSM) gives you visibility and control of your infrastructure (e.g., Run Command, Patch Manager)."},
    {"id":198, "c":4, "q":"A company needs to archive data for 10 years for regulatory compliance at the lowest possible cost. Retrieval time of 12 hours is acceptable. Which S3 storage class is best?", "a":"Amazon S3 Glacier Deep Archive", "d": ["Amazon S3 Glacier Flexible Retrieval", "Amazon S3 Standard", "Amazon S3 Standard-IA", "Amazon S3 Intelligent-Tiering"], "e":"S3 Glacier Deep Archive offers the lowest cost storage in the cloud, suitable for long-term retention where retrieval times of 12-48 hours are acceptable."},
    {"id":199, "c":4, "q":"Which feature of the AWS Enterprise Support plan provides a designated technical point of contact who provides advocacy and guidance?", "a":"Technical Account Manager (TAM)", "d": ["AWS Concierge", "AWS Trusted Advisor", "AWS Professional Services", "AWS Partner Network"], "e":"The TAM is a primary benefit of the Enterprise Support plan, providing proactive guidance."},
    {"id":200, "c":3, "q":"Which AWS infrastructure deployment places compute, storage, and database services closer to large population centers to deliver single-digit millisecond latency?", "a":"AWS Local Zones", "d": ["AWS Wavelength", "AWS Outposts", "Availability Zones", "AWS Regions"], "e":"AWS Local Zones are extensions of an AWS Region that place infrastructure in large cities (population centers) for low-latency requirements."}
]
